console.log('hello!');

// объявление переменных

// ! * let

let student; // можно объявлять переменные не присваивая значения и можно в процессе их менять
student = "Jury";
student = "Natalia";
console.log(typeof student);  // typeof используется для проверки типа переменной
console.log(student);  // значение переменной
// student = 100; // можно менять тип переменной и перезаписывать значение

// ! * const

const language = "JS";  // константам обязательно нужно присваивать значения при объявлении и нельзя меня значения

